/*
 * Config.c
 *
 *  Created on: 2018年11月28日
 *      Author: 江鹏滨
 */
#include "Config.h"
//***********************************************************************
//                   系统时钟初始化，外部8M晶振
//***********************************************************************

void init_clk(){
    uchar i;
    BCSCTL1 &=~ XT2OFF;
    //BCSCTL2 |= DIVS0 + DIVS1;
    BCSCTL2|=SELM1 + SELS;                 //MCLK为32.768KHZ，SMCLK为8MHZ
    do{
        IFG1 &=~ OFIFG;                   //清楚振荡器错误标志
        for(i=0;i<100;i++)
           _NOP();
    }
    while((IFG1&OFIFG)!=0);           //如果标志位1，则继续循环等待
    IFG1&=~OFIFG;
}

//***********************************************************************
//               MSP430内部看门狗初始化
//***********************************************************************
void WDT_Init()
{
   WDTCTL = WDTPW + WDTHOLD;       //关闭看门狗
}
